Repository: Visac95/money_move
Catalog: lib/l10n/app_*.arb
Languages: es

source: No description
es: Sin descripción

# editText
source: Edit
es: Editar

# cancelText
source: Cancel
es: Cancelar

# deleteText
source: Delete
es: Eliminar

# navigationTextHome
source: Home
es: Inicio

# navigationTextTransactions
source: Transactions
es: Movimientos

# navigationTextDeudas
source: Debts
es: Deudas

# titleText
source: Title
es: Título

# dateText
source: Date
es: Fecha

# descriptionText
source: Description
es: Descripción

source: Category
es: Categoría

# cat_food
source: Food
es: Comida

# cat_transport
source: Transportation
es: Transporte

# cat_leisure
source: Leisure
es: Ocio

# cat_health
source: Health
es: Salud

# cat_education
source: Education
es: Educación

# cat_church
source: Church
es: Iglesia

# cat_job
source: Job
es: Empleo

# cat_pet
source: Pet
es: Mascota

# cat_home
source: Home
es: Hogar

# cat_services
source: Services
es: Servicios

# cat_debt
source: Debts
es: Deudas

# cat_others
source: Others
es: Otros

# titleTransactionsScreen
source: Transactions
es: Movimientos

source: No transactions yet 😴
es: No hay movimientos aún 😴

source: Add Transaction
es: Añadir Movimiento

# chooseCategoryManualTitle
source: Choose category for your transaction
es: Elija la categoría para su movimiento

# editTransaccionText
source: Edit Transaction
es: Editar Movimiento

# accitionNotUndone
source: This action cannot be undone.
es: Esta acción no se puede deshacer.

# deleteTransactionText
source: Delete Transaction
es: Eliminar Movimiento

# deletedTransactionMessage
source: Transaction deleted
es: Movimiento eliminado

# deletedDeudaMessege
source: Debt deleted
es: Deuda Eliminada

# titleDeudasScreen
source: Debts
es: Deudas

# noDeudasYet
source: No debts yet 😴
es: No hay deudas aún 😴

# addDeuda
source: Add Debt
es: Añadir Deuda

# editDeudaText
source: Edit Debt
es: Editar Deuda

# changeLanguage
source: Idioma cambiado
es: Language changed

# seeAllTransactionsText
source: See all transactions
es: Ver todos los movimientos

# seeAllDeudasText
source: See all debts
es: Ver todas las deudas

# transactionNotExist
source: The transaction does not exist
es: La transacción no existe

# transactionDetailsTitle
source: Transaction Details
es: Detalle del Movimiento

# deudaDetailsTitle
source: Debt Details
es: Detalle de la Deuda

source: Expense Made
es: Gasto Realizado

source: Income Received
es: Ingreso Recibido

# inputTitleTransactionText
source: Transaction Title
es: Título del movimiento

# writeTitleTransactionHint
source: Enter transaction title
es: Escribe el titulo de tu movimiento

# descriptionTransactionText
source: Transaction Description
es: Descripción de la Transacción

# optionalHintText
source: Optional
es: Opcional

# expenseText
source: Expense
es: Gasto

# incomeText
source: Income
es: Ingreso

# amountText
source: Amount
es: Cantidad

# analizingText
source: Analyzing...
es: Analizando...

# selectCategoryText
source: Select a category
es: Selecionar una categoría

# saveTransactionText
source: Save Transaction
es: Guardar Movimiento

# payableText
source: Payable
es: POR PAGAR

# receivableText
source: Receivable
es: POR COBRAR

# withInvolucradoText
source: With
es: Con

# venceText
source: Due
es: Vence

# allAlrightDeudasText
source: All settled 🎉
es: Todo saldado 🎉

# noOutstandingDeudas
source: You have no outstanding debts
es: No tienes deudas pendientes

# transactionsWillAppearHereText
source: Your transactions will appear here
es: Tus transacciones aparecerán aquí

# deudaTitleText
source: Debt Title
es: Título de la Deuda

# deudaEjTitleText
source: Ex. Shoe purchase
es: Ej. Compra de zapatos

# yoDeboText
source: I owe
es: Yo debo

# meDebenText
source: They owe me
es: Me deben

# involucradoNameHint
source: Person's name
es: Nombre del involucrado

# saveDeudaText
source: Save Debt
es: Guardar Deuda

# quienLeDeboText
source: Who do I owe?
es: ¿A quien le debo?

# quienMeDebeText
source: Who owes me?
es: ¿Quien me debe?

# totalBalanceText
source: Total Balance
es: Balance total

# incomesText
source: Income
es: Ingresos

# expencesText
source: Expenses
es: Gastos

# lastTransactionsText
source: Recent transactions
es: Ultimos movimientos

# lastDeudasText
source: Outstanding debts
es: Deudas pendientes

# areYouSureTitle
source: You're sure?
es: ¿Estás seguro?

# deudasPorPagarText
source: Debts to pay
es: Deudas por pagar

# deudasPorCobrarText
source: Debts to collect
es: Deudas por cobrar

# pagadaText
source: PAID
es: PAGADA

# progressText
source: Progress
es: Progreso

# abonadoText
source: Paid
es: Abonado

# restanteText
source: Remaining
es: Restante

# toText
source: to
es: a

# fromText
source: from
es: de

# cobradoText
source: Collected
es: Cobrado

# pagadoText
source: Paid
es: Pagado

# abonarText
source: Add Payment
es: Abonar

# insertAmountPaymentText
source: Enter the amount to pay
es: Inserte la cantidad a abonar

# abonoForText
source: Credit towards
es: Abono a

# pagoDeText
source: Payment for
es: Pago de

# confirmText
source: Confirm
es: Confirmar

# markAsPaidText
source: Mark as Paid?
es: ¿Marcar como pagada?

# markAsPaidConfirmText
source: This will pay off the remaining balance.
es: Esto saldará la deuda completa por el monto restante.

# deudaPaidSucessText
source: Debt paid successfully! 🎉
es: ¡Deuda pagada exitosamente! 🎉

# totalPorPagarText
source: Total to Pay
es: Total por pagar

# totalPorCobrarText
source: Total to Collect
es: Total por cobrar

# paidDeudasText
source: Paid debts
es: Deudas pagadas

# recivedDeudasText
source: Collected debts
es: Deudas cobradas

# abonoSucessText
source: Payment made successfully
es: Abono realizado con éxito

# putAmountHigherZeroText
source: Enter an amount greater than 0
es: Ingresa un monto mayor a 0

# putAmountLowerText
source: The amount exceeds the remaining balance
es: El monto excede lo que falta por pagar

# errorHasOccurredText
source: An unexpected error has occurred
es: Ocurrió un error inesperado

# seeAsociatedDeuda
source: See associated debt
es: Ver deuda asociada

# debtdescriptionText
source: Debt Description
es: Descripción de la Deuda

# limitDateText
source: Due Date
es: Fecha Límite

# noHistorialText
source: No history
es: Sin historial

# noPaidDeudasText
source: No paid debts in this section yet.
es: Aún no hay deudas liquidadas en esta sección.

# filtrarText
source: Filter
es: Filtrar

# hoyText
source: Today
es: Hoy

# thisWeekText
source: This week
es: Esta semana

# thisMonthText
source: This month
es: Este mes

# thisYearText
source: This year
es: Este año

# todoText
source: All
es: Todo

# seeSettledDeudasText
source: See settled debts
es: Ver deudas liquidadas

# generateAutoTransactionText
source: Generate transaction automatically
es: Generar movimiento automaticamente

# lentFromText
source: Money lent from
es: Dinero prestado de

# lentToText
source: Money lent to
es: Dinero prestado a

# settingsTitle
source: Settings
es: Ajustes

# darkModeText
source: Dark Mode
es: Modo oscuro

# languageText
source: Language
es: Idioma

# pantallaText
source: Screen
es: Pantalla

# stadisticText
source: Statistics
es: Estadísticas

# savingRateText
source: Savings Rate
es: Tasa de Ahorro

# wellDoneText
source: Well done!
es: ¡Bien hecho!

# beCarefulText
source: Be careful
es: Cuidado

# dailyExpenseText
source: Daily Spend
es: Gasto Diario

# promedioEstimadoText
source: Est. average
es: Promedio estimado

# flujoNetoText
source: Net Balance
es: Flujo Neto

# ingresosVsGastosText
source: Income - Expenses
es: Ingresos - Gastos

# bigerExpensesText
source: Largest Expense
es: Mayor Gasto

# saldoEvolutionText
source: Balance Evolution
es: Evolución del Saldo

# cashFlowText
source: Cash Flow
es: Flujo de Caja

# categoryExpencesText
source: Expenses by Category
es: Gastos por Categoría

# noExpensesThisPeriodText
source: No expenses in this period
es: Sin gastos en este periodo

# noExpensesText
source: No expenses
es: No hay gastos

# noConectionModeText
source: No Connection Mode
es: Modo sin conexión

# noConectionModeDescriptionText
source: It seems you are offline. You can continue using the app, but changes from other devices won't be reflected until you regain connection.
es: Parece que no tienes internet. Puedes seguir usando la app, pero los cambios de otros dispositivos no se verán hasta que recuperes la conexión.

# noShowAgainText
source: Don't show this again
es: No volver a mostrar este aviso

# gotItText
source: Got it
es: Entendido

# noConecctionAddTraxText
source: Saved on device. It will upload when online ☁️⏳
es: Guardado en dispositivo. Se subirá al tener internet ☁️⏳

# savedTrasactionSuccessText
source: Transaction saved successfully ✅
es: Transacción guardada exitosamente ✅

# welcomeText
source: Welcome to MoneyMove!
es: ¡Bienvenido a MoneyMove!

# emailText
source: Email
es: Correo Electrónico

# paswordText
source: Password
es: Contraseña

# loginText
source: Log In
es: Iniciar Sesión

# orContinueWithText
source: Or continue with
es: O continuar con

# errorAlEntrarEnText
source: Error logging in
es: Error al entrar

# filtrosText
source: Filters
es: Filtros

# profileText
source: Profile
es: Perfil

# sharedSpaceText
source: Shared Space
es: Espacio Compartido

# sharedSpaceDescriptionText
source: Manage your finances together with someone else
es: Lleva tus finanzas junto a otra persona

# sharedSpaceLargeDescriptionText
source: Connect your account with a partner, family member, or associate. View unified balances, track joint transactions, and reach your financial goals by working as a single team.
es: Conecta tu cuenta con un socio, familiar o compañero. Visualicen sus balances unificados, registren movimientos conjuntos y alcancen sus metas financieras trabajando como un solo equipo.

# inviteSomeoneText
source: Invite someone
es: Invitar a alguien

# uHaveCodeEnterHere
source: Already have a code? Enter it here
es: ¿Ya tienes un código? Ingresalo aquí

# compartidoText
source: Shared
es: Compartido

# actualSpaceText
source: Current Space
es: Espacio actual

# userText
source: User
es: Usuario

# noEmailText
source: No email
es: Sin correo electrónico

# logoutText
source: Log out
es: Cerrar sesión

# invitationMessageText
source: Has invited you to join their shared space.
es: Te ha invitado a unirte a su espacio compartido.

# aceptInvitationText
source: Accept Invitation
es: Aceptar invitación

# invitationCodeErrorText
source: Invalid invitation code
es: Código de invitación inválido

# invitationExpiredText
source: The invitation code has expired
es: El código de invitación ha expirado

# invitationSelfErrorText
source: You cannot join your own space
es: No puedes unirte a tu propio espacio

# invitationSuccessText
source: You have successfully joined the shared space! 🎉
es: ¡Has unido exitosamente al espacio compartido! 🎉

# acceptInvitationAlertText
source: By accepting the invitation, your account will merge with the shared space and you will be able to view and manage joint finances. You will have access to your personal and shared finances in one place.
es: Al aceptar la invitación, tu cuenta se fusionará con el espacio compartido y podrás ver y gestionar las finanzas conjuntas. Tendras acceso a tus finanazas personales y las compartidas en un solo lugar.

# noLogInAlertText
source: To access this feature, please log in or create an account.
es: Para acceder a esta función, por favor inicia sesión o crea una cuenta.

# alreadyInSharedSpaceText
source: You are already in a shared space
es: Ya estás en un espacio compartido

# enterInviteCodeText
source: Enter invitation code
es: Ingresar código de invitación

# inviteCodeHintText
source: Enter the invitation code here
es: Escribe el código de invitación aquí

# invitationCreatedText
source: Invitation Created!
es: ¡Invitación Creada!

# yourCodeText
source: Your code
es: Tu código

# copyLinkText
source: Copy Link
es: Copiar Link

# copiedToClipboardText
source: Copied to clipboard!
es: ¡Copiado al portapapeles!

# readyInvitationCreatedText
source: Ready! Invitation created
es: ¡Listo! Invitación creada

# errorCreatingInvitationText
source: Error creating invitation
es: Error al crear la invitación

# exitSharedSpaceText
source: Exit Shared Space
es: Salir del espacio compartido

# exitSharedSpaceDescriptionText
source: By exiting the shared space, your account will return to personal and you will no longer have access to joint finances. Your personal data will remain intact.
es: Al salir del espacio compartido, tu cuenta volverá a ser personal y ya no tendrás acceso a las finanzas conjuntas. Tus datos personales permanecerán intactos.

# areYouSureExitText
source: Are you sure you want to exit?
es: ¿Estás seguro de que quieres salir?

# leftSharedSpaceSuccessText
source: You have successfully left the shared space! 🎉
es: Has salido exitosamente del espacio compartido

# exitText
source: Exit
es: Salir

# loadingFinancesText
source: Loading your finances...
es: Cargando tus finanzas...
